app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolios = Portfolio.all

INSERT INTO "portfolios" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Santos"], ["user_id", 6], ["created_at", "2020-06-11 18:11:29.732524"], ["updated_at", "2020-06-11 18:11:29.732524"]]
---
  def create
    @portfolio = Portfolio.new(portfolio_params)

    if @portfolio.save

UPDATE "portfolios" SET "name" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["name", "brian"], ["updated_at", "2020-06-11 19:41:24.358368"], ["id", 10]]
---
  def update
    if @portfolio.update(portfolio_params)

DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 9]]
---
  def destroy
    @portfolio.destroy

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "securities".* FROM "securities" WHERE "securities"."portfolio_id" = $1  [["portfolio_id", 9]]
---
  def port_to_security
    @port = Portfolio.find(params[:portfolio_id])
    @security = Security.find(params[:id])

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_portfolio
    @portfolio = Portfolio.find(params[:id])