app/controllers/securities_controller.rb

SELECT "securities".* FROM "securities"
---
  def index
    @securities = Security.all